/**~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
＊　ファイル名　： temp_sens_driver_in.h
＊　責務　　　：
＊　作成日　　： 2017/10/13
＊　作成者　　：　kern-gt

＊　備考　　　：
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~**/
#ifndef _TEMP_SENS_DRIVER_IN_H_
#define _TEMP_SENS_DRIVER_IN_H_

#include "temp_sens_driver.h"

/**----------------------------------------------------------------------------
<<非公開マクロ定義>>
-----------------------------------------------------------------------------**/


/**----------------------------------------------------------------------------
<<非公開型定義>>
-----------------------------------------------------------------------------**/
typedef struct{
	float    temp;
	float    humi;
	uint32_t count;
}TempHumiData;

/**----------------------------------------------------------------------------
<<非公開プロトタイプ定義>>
-----------------------------------------------------------------------------**/
/*static */
static void InitTempSens(void);
static void TempSensRead(void);
static void ConvertSensorVal(TempHumiData *temp_humi_p, uint8_t *data);
#endif /*_TEMP_SENS_DRIVER_IN_H_*/