/**~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
＊　ファイル名　： hdc1000.h
＊　責務　　　：
＊　作成日　　： 2017/10/13
＊　作成者　　：　kern-gt

＊　備考　  ：
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~**/
#ifndef _HDC1000_H_
#define _HDC1000_H_

/**----------------------------------------------------------------------------
<<外部公開マクロ定義>>
-----------------------------------------------------------------------------**/
#define HDC1000_ADDR (0x40)	//I2CAddress

/*  */

/**----------------------------------------------------------------------------
<<外部公開型定義>>
-----------------------------------------------------------------------------**/
//HDC-1000用レジスタアドレス定義*********************
typedef enum{
	kTemperature = 0x00,
	kHumidity,
	kConfiguration,
	kSerialIdFirst = 0xFB,
	kSerialIdMid,
	kSerialIdLast,
	kManufactID,
	kDeviceID
}Hdc1000RegAddressEnum;

typedef union{
	uint8_t word[2];
	struct
	{
		uint8_t :8;
		uint8_t hres:2;
		uint8_t tres:1;
		uint8_t btst:1;
		uint8_t mode:1;
		uint8_t :2;
		uint8_t rst: 1;
	}bit;
}Hdc1000Config;

typedef union{
	uint8_t read[4];
	struct
	{
		uint8_t temp_h;
		uint8_t temp_l;
		uint8_t humi_h;
		uint8_t humi_l;
	}value;
}Hdc1000SensValue;

/**----------------------------------------------------------------------------
<<外部公開プロトタイプ定義>>
-----------------------------------------------------------------------------**/
/*extern*/

#endif /* _HDC1000_H_ */