/**~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
＊　ファイル名　： disp_main.c
＊　責務　　　：
＊　作成日　　： 2017/10/19
＊　作成者　　：　kern-gt

＊　コンパイラ　：CC-RX

＊　備考　　　：
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~**/

/**----------------------------------------------------------------------------
<<利用ファイルのヘッダ>>
-----------------------------------------------------------------------------**/
#include "r_cg_macrodriver.h"
#include "r_cg_userdefine.h"
#include <stdint.h>

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

/* 描画ドライバ */
#include "oled.h"

/* アニメーション */
#include "disp_clock.h"
/**----------------------------------------------------------------------------
<<自ファイルのヘッダ>>
-----------------------------------------------------------------------------**/
#include "disp_main_in.h"

/**----------------------------------------------------------------------------
<<変数>>
-----------------------------------------------------------------------------**/


/***公開関数*******************************************************************/
/**~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
＊　関数名　：
＊　機能　　：
＊　引数　　：
＊　戻り値　：
＊　備考　　：
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~**/
void DisplayApli(void){

	InitOled();
	Bitblt();

	while(1){
		vTaskDelay(250/portTICK_PERIOD_MS);
		if(AnimationStateCtrl())
		{
			Bitblt();
		}
	}
}


/***非公開関数******************************************************************/
/**~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
＊　関数名　：
＊　機能　　：
＊　引数　　：
＊　戻り値　：
＊　備考　　：
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~**/
static uint8_t AnimationStateCtrl(void){
	static AnimationFlameEnum anitype = kAniClock;
	static uint8_t state_change_flag = TRUE;
	static uint32_t limit_time = 100;
	uint8_t bitblt_flag = FALSE;

	//状態遷移イベント検出
	limit_time--;

	if(limit_time == 0)
	{
		limit_time = 100;
	}

	//現在状態に応じてディスパッチ
	switch(anitype){
		case kAniClock:
			bitblt_flag = DispClock(state_change_flag);
			state_change_flag = FALSE;
			break;

		default:
			break;
	}

	return(bitblt_flag);
}